Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MX_DFP/1.5.259/atdf/PIC32MX440F256H.atdf
      <value-group caption="Bus Error from CPU Data Access bit" name="BMXCON__BMXERRDS">
         <value caption="Enable bus error exceptions for unmapped address accesses initiated from CPU data access" name="" value="0x1" />
         <value caption="Disable bus error exceptions for unmapped address accesses initiated from CPU data access" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Error from DMA bit" name="BMXCON__BMXERRDMA">
         <value caption="Enable bus error exceptions for unmapped address accesses initiated from DMA" name="" value="0x1" />
         <value caption="Disable bus error exceptions for unmapped address accesses initiated from DMA" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Bus Error from ICD Debug Unit bit" name="BMXCON__BMXERRICD">
         <value caption="Enable bus error exceptions for unmapped address accesses initiated from ICD" name="" value="0x1" />
         <value caption="Disable bus error exceptions for unmapped address accesses initiated from ICD" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Bus Error from IXI bit" name="BMXCON__BMXERRIXI">
         <value caption="Enable bus error exceptions for unmapped address accesses initiated from IXI shared bus" name="" value="0x1" />
         <value caption="Disable bus error exceptions for unmapped address accesses initiated from IXI shared bus" name="" value="0x0" />
      </value-group>
      <value-group caption="BMX PFM Cacheability for DMA Accesses bit" name="BMXCON__BMXCHEDMA">
         <value caption="Enable program Flash memory (data) cacheability for DMA accesses (requires cache to have data caching enabled)" name="" value="0x1" />
         <value caption="Disable program Flash memory (data) cacheability for DMA accesses(hits are still read from the cache" name="" value="0x0" />
      </value-group>
      <value-group caption="DRM Kernel Program Base Address bits (bits 15-10, bits 9-0 are read only)" name="BMXDKPBA__BMXDKPBA">
         <value caption="No relative base address set" name="" value="0x0" />
      </value-group>
      <value-group caption="DRM User Data Base Address bits (bits 15-10, bits 9-0 are read only)" name="BMXDUDBA__BMXDUDBA">
         <value caption="No relative base address set" name="" value="0x0" />
      </value-group>
      <value-group caption="DRM User Program Base Address bits (bits 15-10, bits 9-0 are read only)" name="BMXDUPBA__BMXDUPBA">
         <value caption="No relative base address set" name="" value="0x0" />
      </value-group>
      <value-group caption="Data RAM Memory Size bits" name="BMXDRMSZ__BMXDRMSZ">
         <value caption="Device has 16 KB RAM" name="" value="0x4000" />
         <value caption="Device has 32 KB RAM" name="" value="0x8000" />
         <value caption="Device has 64 KB RAM" name="" value="0x10000" />
         <value caption="Device has 128 KB RAM" name="" value="0x20000" />
      </value-group>
      <value-group caption="Program Flash Memory (PFM) Size bits" name="BMXPFMSZ__BMXPFMSZ">
         <value caption="Device has 64 KB Flash" name="" value="0x10000" />
         <value caption="Device has 128 KB Flash" name="" value="0x20000" />
         <value caption="Device has 256 KB Flash" name="" value="0x40000" />
         <value caption="Device has 512 KB Flash" name="" value="0x80000" />
      </value-group>
      <value-group caption="Boot Flash Memory Size bits" name="BMXBOOTSZ__BMXBOOTSZ">
         <value caption="Device has 12 KB Boot Flash" name="" value="0x3000" />
      </value-group>
   </module>
   <module caption="" id="00868" name="CFG" version="">
      <register-group name="CFG">
         <register caption="" name="DDPCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Trace Output Enable bit" mask="0x00000004" name="TROEN" values="DDPCON__TROEN" />
            <bitfield caption="JTAG Port Enable bit" mask="0x00000008" name="JTAGEN" values="DDPCON__JTAGEN" />
         </register>
         <register caption="" name="DEVID" offset="0x20" rw="R" size="4">
            <bitfield mask="0x0FFFFFFF" name="DEVID" />
            <bitfield mask="0xF0000000" name="VER" />
         </register>
         <register caption="" name="SYSKEY" offset="0x30" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="SYSKEY" />
         </register>
      </register-group>
      <value-group caption="Trace Output Enable bit" name="DDPCON__TROEN">
         <value caption="Enable trace outputs and start trace clock (trace probe must be present)" name="" value="0x1" />
         <value caption="Disable trace outputs and stop trace clock" name="" value="0x0" />
      </value-group>
      <value-group caption="JTAG Port Enable bit" name="DDPCON__JTAGEN">
         <value caption="Enable the JTAG port" name="" value="0x1" />
         <value caption="Disable the JTAG port" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00866" name="CMP" version="2">
      <register-group name="CMP">
         <register caption="Comparator Control Register" name="CM1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Comparator Negative Input Select bits for Comparator" mask="0x00000003" name="CCH" values="CM1CON__CCH" />
            <bitfield caption="Comparator Positive Input Configure bit" mask="0x00000010" name="CREF" values="CM1CON__CREF" />
            <bitfield caption="Interrupt Event Polarity Select bits" mask="0x000000C0" name="EVPOL" values="CM1CON__EVPOL" />
            <bitfield caption="Comparator Output bit" mask="0x00000100" name="COUT" values="CM1CON__COUT" />
            <bitfield caption="Comparator Output Inversion bit" mask="0x00002000" name="CPOL" values="CM1CON__CPOL" />
            <bitfield caption="Comparator Output Enable bit" mask="0x00004000" name="COE" values="CM1CON__COE" />
            <bitfield caption="Comparator ON bit" mask="0x00008000" name="ON" values="CM1CON__ON" />
         </register>
         <register caption="Comparator Control Register" name="CM2CON" offset="0x10" rw="RW" size="4">
            <bitfield caption="Comparator Negative Input Select bits for Comparator" mask="0x00000003" name="CCH" values="CM2CON__CCH" />
            <bitfield caption="Comparator Positive Input Configure bit" mask="0x00000010" name="CREF" values="CM2CON__CREF" />
            <bitfield caption="Interrupt Event Polarity Select bits" mask="0x000000C0" name="EVPOL" values="CM2CON__EVPOL" />
            <bitfield caption="Comparator Output bit" mask="0x00000100" name="COUT" values="CM2CON__COUT" />
            <bitfield caption="Comparator Output Inversion bit" mask="0x00002000" name="CPOL" values="CM2CON__CPOL" />
            <bitfield caption="Comparator Output Enable bit" mask="0x00004000" name="COE" values="CM2CON__COE" />
            <bitfield caption="Comparator ON bit" mask="0x00008000" name="ON" values="CM2CON__ON" />
         </register>
         <register caption="Comparator Status Register" name="CMSTAT" offset="0x60" rw="RW" size="4">
            <bitfield caption="Comparator Output bit" mask="0x00000001" name="C1OUT" values="CMSTAT__C1OUT" />
            <bitfield caption="Comparator Output bit" mask="0x00000002" name="C2OUT" values="CMSTAT__C2OUT" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="CMSTAT__SIDL" />
         </register>
      </register-group>
      <value-group caption="Comparator Negative Input Select bits for Comparator" name="CM1CON__CCH">
         <value caption="Comparator inverting input is connected to the IVREF" name="" value="0x3" />
         <value caption="Comparator inverting input is connected to the C2IN+ pin" name="" value="0x2" />
         <value caption="Comparator inverting input is connected to the C1IN+ pin" name="" value="0x1" />
         <value caption="Comparator inverting input is connected to the C1IN- pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Positive Input Configure bit" name="CM1CON__CREF">
         <value caption="Comparator non-inverting input is connected to the internal CVREF" name="" value="0x1" />
         <value caption="Comparator non-inverting input is connected to the C1IN+ pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Event Polarity Select bits" name="CM1CON__EVPOL">
         <value caption="Comparator interrupt is generated on a low-to-high or high-to-low transition of the comparator output" name="" value="0x3" />
         <value caption="Comparator interrupt is generated on a high-to-low transition of the comparator output" name="" value="0x2" />
         <value caption="Comparator interrupt is generated on a low-to-high transition of the comparator output" name="" value="0x1" />
         <value caption="Comparator interrupt generation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output bit" name="CM1CON__COUT">
         <value caption="Output of the Comparator is a 1" name="" value="0x1" />
         <value caption="Output of the Comparator is a 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Inversion bit" name="CM1CON__CPOL">
         <value caption="Output is inverted" name="" value="0x1" />
         <value caption="Output is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Enable bit" name="CM1CON__COE">
         <value caption="Comparator output is driven on the output CxOUT pin" name="" value="0x1" />
         <value caption="Comparator output is not driven on the output CxOUT pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator ON bit" name="CM1CON__ON">
         <value caption="Module is enabled. Setting this bit does not affect the other bits in this register" name="" value="0x1" />
         <value caption="Module is disabled and does not consume current. Clearing this bit does not affect the other bits in this register" name="" value="0x0" />
      </value-group>
