Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MX_DFP/1.5.259/atdf/PIC32MX440F256H.atdf
         <register caption="Interrupt Flag Status Register 0" name="IFS0" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CTIF" />
            <bitfield mask="0x00000002" name="CS0IF" />
            <bitfield mask="0x00000004" name="CS1IF" />
            <bitfield mask="0x00000008" name="INT0IF" />
            <bitfield mask="0x00000010" name="T1IF" />
            <bitfield mask="0x00000020" name="IC1IF" />
            <bitfield mask="0x00000040" name="OC1IF" />
            <bitfield mask="0x00000080" name="INT1IF" />
            <bitfield mask="0x00000100" name="T2IF" />
            <bitfield mask="0x00000200" name="IC2IF" />
            <bitfield mask="0x00000400" name="OC2IF" />
            <bitfield mask="0x00000800" name="INT2IF" />
            <bitfield mask="0x00001000" name="T3IF" />
            <bitfield mask="0x00002000" name="IC3IF" />
            <bitfield mask="0x00004000" name="OC3IF" />
            <bitfield mask="0x00008000" name="INT3IF" />
            <bitfield mask="0x00010000" name="T4IF" />
            <bitfield mask="0x00020000" name="IC4IF" />
            <bitfield mask="0x00040000" name="OC4IF" />
            <bitfield mask="0x00080000" name="INT4IF" />
            <bitfield mask="0x00100000" name="T5IF" />
            <bitfield mask="0x00200000" name="IC5IF" />
            <bitfield mask="0x00400000" name="OC5IF" />
            <bitfield mask="0x00800000" name="SPI1EIF" />
            <bitfield mask="0x01000000" name="SPI1TXIF" />
            <bitfield mask="0x02000000" name="SPI1RXIF" />
            <bitfield mask="0x04000000" name="U1EIF" />
            <bitfield mask="0x08000000" name="U1RXIF" />
            <bitfield mask="0x10000000" name="U1TXIF" />
            <bitfield mask="0x20000000" name="I2C1BIF" />
            <bitfield mask="0x40000000" name="I2C1SIF" />
            <bitfield mask="0x80000000" name="I2C1MIF" />
         </register>
         <register caption="" name="IFS1" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNIF" />
            <bitfield mask="0x00000002" name="AD1IF" />
            <bitfield mask="0x00000004" name="PMPIF" />
            <bitfield mask="0x00000008" name="CMP1IF" />
            <bitfield mask="0x00000010" name="CMP2IF" />
            <bitfield mask="0x00000020" name="SPI2EIF" />
            <bitfield mask="0x00000040" name="SPI2TXIF" />
            <bitfield mask="0x00000080" name="SPI2RXIF" />
            <bitfield mask="0x00000100" name="U2EIF" />
            <bitfield mask="0x00000200" name="U2RXIF" />
            <bitfield mask="0x00000400" name="U2TXIF" />
            <bitfield mask="0x00000800" name="I2C2BIF" />
            <bitfield mask="0x00001000" name="I2C2SIF" />
            <bitfield mask="0x00002000" name="I2C2MIF" />
            <bitfield mask="0x00004000" name="FSCMIF" />
            <bitfield mask="0x00008000" name="RTCCIF" />
            <bitfield mask="0x00010000" name="DMA0IF" />
            <bitfield mask="0x00020000" name="DMA1IF" />
            <bitfield mask="0x00040000" name="DMA2IF" />
            <bitfield mask="0x00080000" name="DMA3IF" />
            <bitfield mask="0x01000000" name="FCEIF" />
            <bitfield mask="0x02000000" name="USBIF" />
         </register>
         <register caption="Interrupt Enable Control Register 0" name="IEC0" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CTIE" />
            <bitfield mask="0x00000002" name="CS0IE" />
            <bitfield mask="0x00000004" name="CS1IE" />
            <bitfield mask="0x00000008" name="INT0IE" />
            <bitfield mask="0x00000010" name="T1IE" />
            <bitfield mask="0x00000020" name="IC1IE" />
            <bitfield mask="0x00000040" name="OC1IE" />
            <bitfield mask="0x00000080" name="INT1IE" />
            <bitfield mask="0x00000100" name="T2IE" />
            <bitfield mask="0x00000200" name="IC2IE" />
            <bitfield mask="0x00000400" name="OC2IE" />
            <bitfield mask="0x00000800" name="INT2IE" />
            <bitfield mask="0x00001000" name="T3IE" />
            <bitfield mask="0x00002000" name="IC3IE" />
            <bitfield mask="0x00004000" name="OC3IE" />
            <bitfield mask="0x00008000" name="INT3IE" />
            <bitfield mask="0x00010000" name="T4IE" />
            <bitfield mask="0x00020000" name="IC4IE" />
            <bitfield mask="0x00040000" name="OC4IE" />
            <bitfield mask="0x00080000" name="INT4IE" />
            <bitfield mask="0x00100000" name="T5IE" />
            <bitfield mask="0x00200000" name="IC5IE" />
            <bitfield mask="0x00400000" name="OC5IE" />
            <bitfield mask="0x00800000" name="SPI1EIE" />
            <bitfield mask="0x01000000" name="SPI1TXIE" />
            <bitfield mask="0x02000000" name="SPI1RXIE" />
            <bitfield mask="0x04000000" name="U1EIE" />
            <bitfield mask="0x08000000" name="U1RXIE" />
            <bitfield mask="0x10000000" name="U1TXIE" />
            <bitfield mask="0x20000000" name="I2C1BIE" />
            <bitfield mask="0x40000000" name="I2C1SIE" />
            <bitfield mask="0x80000000" name="I2C1MIE" />
         </register>
         <register caption="nterrupt Enable Control Register 1" name="IEC1" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNIE" />
            <bitfield mask="0x00000002" name="AD1IE" />
            <bitfield mask="0x00000004" name="PMPIE" />
            <bitfield mask="0x00000008" name="CMP1IE" />
            <bitfield mask="0x00000010" name="CMP2IE" />
            <bitfield mask="0x00000020" name="SPI2EIE" />
            <bitfield mask="0x00000040" name="SPI2TXIE" />
            <bitfield mask="0x00000080" name="SPI2RXIE" />
            <bitfield mask="0x00000100" name="U2EIE" />
            <bitfield mask="0x00000200" name="U2RXIE" />
            <bitfield mask="0x00000400" name="U2TXIE" />
            <bitfield mask="0x00000800" name="I2C2BIE" />
            <bitfield mask="0x00001000" name="I2C2SIE" />
            <bitfield mask="0x00002000" name="I2C2MIE" />
            <bitfield mask="0x00004000" name="FSCMIE" />
            <bitfield mask="0x00008000" name="RTCCIE" />
            <bitfield mask="0x00010000" name="DMA0IE" />
            <bitfield mask="0x00020000" name="DMA1IE" />
            <bitfield mask="0x00040000" name="DMA2IE" />
            <bitfield mask="0x00080000" name="DMA3IE" />
            <bitfield mask="0x01000000" name="FCEIE" />
            <bitfield mask="0x02000000" name="USBIE" />
         </register>
         <register caption="Interrupt Priority Control Register 0" name="IPC0" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CTIS" />
            <bitfield mask="0x0000001C" name="CTIP" />
            <bitfield mask="0x00000300" name="CS0IS" />
            <bitfield mask="0x00001C00" name="CS0IP" />
            <bitfield mask="0x00030000" name="CS1IS" />
            <bitfield mask="0x001C0000" name="CS1IP" />
            <bitfield mask="0x03000000" name="INT0IS" />
            <bitfield mask="0x1C000000" name="INT0IP" />
         </register>
         <register caption="Interrupt Priority Control Register 1" name="IPC1" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T1IS" />
            <bitfield mask="0x0000001C" name="T1IP" />
            <bitfield mask="0x00000300" name="IC1IS" />
            <bitfield mask="0x00001C00" name="IC1IP" />
            <bitfield mask="0x00030000" name="OC1IS" />
            <bitfield mask="0x001C0000" name="OC1IP" />
            <bitfield mask="0x03000000" name="INT1IS" />
            <bitfield mask="0x1C000000" name="INT1IP" />
         </register>
         <register caption="Interrupt Priority Control Register 2" name="IPC2" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T2IS" />
            <bitfield mask="0x0000001C" name="T2IP" />
            <bitfield mask="0x00000300" name="IC2IS" />
            <bitfield mask="0x00001C00" name="IC2IP" />
            <bitfield mask="0x00030000" name="OC2IS" />
            <bitfield mask="0x001C0000" name="OC2IP" />
            <bitfield mask="0x03000000" name="INT2IS" />
            <bitfield mask="0x1C000000" name="INT2IP" />
         </register>
         <register caption="Interrupt Priority Control Register 3" name="IPC3" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T3IS" />
            <bitfield mask="0x0000001C" name="T3IP" />
            <bitfield mask="0x00000300" name="IC3IS" />
            <bitfield mask="0x00001C00" name="IC3IP" />
            <bitfield mask="0x00030000" name="OC3IS" />
            <bitfield mask="0x001C0000" name="OC3IP" />
            <bitfield mask="0x03000000" name="INT3IS" />
            <bitfield mask="0x1C000000" name="INT3IP" />
         </register>
