Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MX_DFP/1.5.259/atdf/PIC32MX440F256H.atdf
      <value-group caption="Alarm Mask Configuration bits" name="RTCALRM__AMASK">
         <value caption="Every half-second" name="" value="0x0" />
         <value caption="Every second" name="" value="0x1" />
         <value caption="Every 10 seconds" name="" value="0x2" />
         <value caption="Every minute" name="" value="0x3" />
         <value caption="Every 10 minutes" name="" value="0x4" />
         <value caption="Every hour" name="" value="0x5" />
         <value caption="Once a day" name="" value="0x6" />
         <value caption="Once a week" name="" value="0x7" />
         <value caption="Once a month" name="" value="0x8" />
         <value caption="Once a year (except when configured for February 29" name="" value="0x9" />
         <value caption="Reserved; do not use" name="" value="0xa" />
         <value caption="Reserved; do not use" name="" value="0xb" />
         <value caption="Reserved; do not use" name="" value="0xc" />
         <value caption="Reserved; do not use" name="" value="0xd" />
         <value caption="Reserved; do not use" name="" value="0xe" />
         <value caption="Reserved; do not use" name="" value="0xf" />
      </value-group>
      <value-group caption="Alarm Sync bit" name="RTCALRM__ALRMSYNC">
         <value caption="ARPT(7:0) and ALRMEN may change as a result of a half second rollover during a read." name="" value="0x1" />
         <value caption="ARPT(7:0) and ALRMEN can be read without concerns of rollover because the prescaler is more than 32 RTC clocks away from a half-second rollover" name="" value="0x0" />
      </value-group>
      <value-group caption="Alarm Pulse Initial Value bit" name="RTCALRM__PIV">
         <value caption="(When ALRMEN = 0) Alarm pulse high / (When ALRMEN = 1) PIV is read-only and returns state of the alarm pulse." name="" value="0x1" />
         <value caption="(When ALRMEN = 0) Alarm pulse low / (When ALRMEN = 1) PIV is read-only and returns state of the alarm pulse." name="" value="0x0" />
      </value-group>
      <value-group caption="Chime Enable bit" name="RTCALRM__CHIME">
         <value caption="Chime is enabled ARPT(7:0) is allowed to rollover from 0x00 to 0xFF" name="" value="0x1" />
         <value caption="Chime is disabled ARPT(7:0) stops once it reaches 0x00" name="" value="0x0" />
      </value-group>
      <value-group caption="Alarm Enable bit" name="RTCALRM__ALRMEN">
         <value caption="Alarm is enabled" name="" value="0x1" />
         <value caption="Alarm is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00753" name="SPI" version="1">
      <register-group name="SPI">
         <register caption="SPI Control Register" name="SPI2CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Master Mode Enable bit" mask="0x00000020" name="MSTEN" values="SPI2CON__MSTEN" />
            <bitfield caption="Clock Polarity Select bit" mask="0x00000040" name="CKP" values="SPI2CON__CKP" />
            <bitfield caption="Slave Select Enable bit" mask="0x00000080" name="SSEN" values="SPI2CON__SSEN" />
            <bitfield caption="SPI Clock Edge Select bit" mask="0x00000100" name="CKE" values="SPI2CON__CKE" />
            <bitfield caption="SPI Data Input Sample Phase bit (master mode only)" mask="0x00000200" name="SMP" values="SPI2CON__SMP" />
            <bitfield caption="32/16-Bit Communication Select bits" mask="0x00000C00" name="MODE32" values="SPI2CON__MODE32" />
            <bitfield caption="Disable SDOx pin bit" mask="0x00001000" name="DISSDO" values="SPI2CON__DISSDO" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="SPI2CON__SIDL" />
            <bitfield caption="SPI Peripheral On bit" mask="0x00008000" name="ON" values="SPI2CON__ON" />
            <bitfield caption="Frame Sync Pulse Edge Select bit" mask="0x00020000" name="SPIFE" values="SPI2CON__SPIFE" />
            <bitfield caption="Frame Sync Polarity bit (Framed SPI mode only)" mask="0x20000000" name="FRMPOL" values="SPI2CON__FRMPOL" />
            <bitfield caption="Frame Sync Pulse Direction Control on SSx pin bit (Framed SPI mode only)" mask="0x40000000" name="FRMSYNC" values="SPI2CON__FRMSYNC" />
            <bitfield caption="Framed SPI Support bit" mask="0x80000000" name="FRMEN" values="SPI2CON__FRMEN" />
         </register>
         <register caption="" name="SPI2STAT" offset="0x10" rw="R" size="4">
            <bitfield caption="SPI Receive Buffer Full Status bit" mask="0x00000001" name="SPIRBF" values="SPI2STAT__SPIRBF" />
            <bitfield caption="SPI Transmit Buffer Empty Status bit" mask="0x00000008" name="SPITBE" values="SPI2STAT__SPITBE" />
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="SPIROV" values="SPI2STAT__SPIROV" />
            <bitfield caption="SPI Activity Status bit" mask="0x00000800" name="SPIBUSY" values="SPI2STAT__SPIBUSY" />
         </register>
         <register caption="" name="SPI2BUF" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SPI2BUF" />
         </register>
         <register caption="" name="SPI2BRG" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="SPI2BRG" />
         </register>
      </register-group>
      <value-group caption="Master Mode Enable bit" name="SPI2CON__MSTEN">
         <value caption="Master mode" name="" value="0x1" />
         <value caption="Slave mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Clock Polarity Select bit" name="SPI2CON__CKP">
         <value caption="Idle state for clock is a high level; active state is a low level" name="" value="0x1" />
         <value caption="Idle state for clock is a low level; active state is a high level" name="" value="0x0" />
      </value-group>
      <value-group caption="Slave Select Enable bit" name="SPI2CON__SSEN">
         <value caption="SSx pin used for Slave mode" name="" value="0x1" />
         <value caption="SSx pin not used for Slave mode" name="" value="0x0" />
      </value-group>
